000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияКонтрагентов/ОповещенияКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОповещенияКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаАннуляции</name>
    <comment>заполняется, если вид сообщения - &quot;Аннуляция&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОповещения</name>
    <type>
      <types>EnumRef.ВидыОповещений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОповещенияКонтрагентов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//	LNK 25.09.2023 16:17:51
Процедура Регистрация(Контрагент, ВидОповещения, ДанныеОповещения, Знач Период = '00010101', Отладка = Ложь)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если Период = '00010101' Тогда

		Период = ТекущаяДата();

	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ОповещенияКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Отбор.ВидОповещения.Установить(ВидОповещения);

	ЗаписьНабора = НаборЗаписей.Добавить();

	ЗаписьНабора.Период		= НаборЗаписей.Отбор.Период.Значение;
	ЗаписьНабора.Контрагент	= НаборЗаписей.Отбор.Контрагент.Значение;
	ЗаписьНабора.ВидОповещения	= НаборЗаписей.Отбор.ВидОповещения.Значение;

	ЗаписьНабора.НомерТелефона = ДанныеОповещения.НомерТелефона;
	ЗаписьНабора.ДатаАннуляции = ДанныеОповещения.ДатаАннуляции;

	ЗаписьНабора.ДатаИзменения = ТекущаяДата();
	ЗаписьНабора.Сообщение	   = ДанныеОповещения.ТекстСообщения;
	ЗаписьНабора.Хранилище	   = Новый ХранилищеЗначения(ДанныеОповещения.ТекстСообщения, Новый СжатиеДанных(9));

	Если НЕ Отладка = Истина Тогда

		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
